config.org
#+title Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+auto_tangle: t
#+STARTUP: content

* Early init
Some early init code to run before everything started.
#+begin_src emacs-lisp :tangle ./early-init.el
  ;; in ~/.emacs.d/init.el (or ~/.emacs.d/early-init.el in Emacs 27)
  (setq package-enable-at-startup nil ; don't auto-initialize!
        ;; don't add that `custom-set-variables' block to my init.el!
        package--init-file-ensured t)

  ;;; Native compilation support (see http://akrl.sdf.org/gccemacs.html)
  (when (boundp 'native-comp-eln-load-path)
    ;; Don't store eln files in ~/.emacs.d/eln-cache
    ;; Use startup-redirect-eln-cache in Emacs 29
    (startup-redirect-eln-cache (expand-file-name (convert-standard-filename "var/eln-cache/")
                                                  user-emacs-directory)))

  (setq package-enable-at-startup nil) ; For Emacs version >= 27
  (setq inhibit-automatic-native-compilation t)

  ;; Integration of straight.el and flycheck.
  (setq straight-fix-flycheck t)

  ;; UI Customization
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b")
        ring-bell-function 'ignore
        use-dialog-box t ; only for mouse events, which I seldom use
        use-file-dialog nil
        use-short-answers t
        inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-x-resources t
        inhibit-startup-echo-area-message user-login-name ; read the docstring
        inhibit-startup-buffer-menu t)

  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (menu-bar-mode -1)
  (blink-cursor-mode -1)
  ;; nice scrolling
  (setq scroll-margin 0
        scroll-conservatively 100000
        scroll-preserve-screen-position 1)
  (size-indication-mode t) ; show size on mode line

  ;; Same idea as above for the `file-name-handler-alist' and the
  ;; `vc-handled-backends' with regard to startup speed optimisation.
  ;; Here I am storing the default value with the intent of restoring it
  ;; via the `emacs-startup-hook'.
  (defvar sin-emacs--file-name-handler-alist file-name-handler-alist)
  (defvar sin-emacs--vc-handled-backends vc-handled-backends)

  (setq file-name-handler-alist nil
        vc-handled-backends nil)

  ;; tweak native compilation settingss
  (setq native-comp-speed 2)

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold (* 1024 1024 20)
                    gc-cons-percentage 0.2
                    file-name-handler-alist sin-emacs--file-name-handler-alist
                    vc-handled-backends sin-emacs--vc-handled-backends)))

  ;; name the default frame as "home"
  ;; (add-hook 'after-init-hook (lambda () (set-frame-name "home")))
#+end_src
* Package Setup
** Straight & use-package
Use straight and use-package-compute-statistics to manage packages. These two packages should be loaded before any other files.
#+begin_src emacs-lisp
  ;; Straight.el bootstrap
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package) ; Load use-package
  (straight-use-package 'project) ; workaround for projectile + eglot
#+end_src
** Startup diagnostic
#+begin_src emacs-lisp
  ;; (setq use-package-compute-statistics t)

  ;; (use-package benchmark-init
  ;;   :straight t
  ;;   :config
  ;;   ;; To disable collection of benchmark data after init is done.
  ;;   (add-hook 'after-init-hook 'benchmark-init/deactivate))
#+end_src
** Auto tangle
#+begin_src emacs-lisp
  (use-package org-auto-tangle
    :straight t
    :defer t
    :hook
    (org-mode . org-auto-tangle-mode)
    :config
    (setq org-auto-tangle-babel-safelist '(
                                           "~/.emacs.d/config.org"
                                           )))
#+end_src
** Cleanup
#+begin_src emacs-lisp
  (use-package no-littering
    :straight t
    :config
    (setq custom-file (no-littering-expand-etc-file-name "custom.el"))
    (when (fboundp 'startup-redirect-eln-cache)
      (startup-redirect-eln-cache
       (convert-standard-filename
  (expand-file-name  "var/eln-cache/" user-emacs-directory)))))
#+end_src
** Emacs
#+begin_src emacs-lisp
  ;; Make native compilation silent and prune its cache.
  (when (native-comp-available-p)
    (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
    (setq native-compile-prune-cache t)) ; Emacs 29

  ;; Disable the damn thing by making it disposable.
  (setq custom-file (make-temp-file "emacs-custom-"))

  ;; Do not remind me of unsafe themes
  (setq custom-safe-themes t)

  (use-package emacs
    :bind
    ("C-c f p" . yu/find-file-in-private-config)
    ("C-c q r" . 'restart-emacs)
    ("C-c b b" . 'my/consult-buffer)
    ("C-c b B" . 'consult-buffer)
    ("C-c b k" . 'kill-current-buffer)
    :custom
    ;; TAB cycle if there are only few candidates
    (completion-cycle-threshold 3)

    ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
    ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
    (read-extended-command-predicate
     #'command-completion-default-include-p)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (tab-always-indent 'complete)

    ;; Enable recursive minibuffers
    (enable-recursive-minibuffers t)

    ;; Disable popup confirmations
    (use-dialog-box nil)
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    ;; Remember and restore the last cursor location of opened files
    ;; (save-place-mode 1)
    ;; (setq save-place-file (concat user-emacs-directory "var/saveplace"))

    ;; Revert buffers when the underlying file has changed
    (global-auto-revert-mode 1)
    :config
    (defalias 'yes-or-no-p 'y-or-n-p)
    ;; Disable auto-save
    (setq auto-save-default nil)

    ;; Disable backup-files
    (setq make-backup-files nil)
    (setq backup-inhibited nil)
    (setq create-lockfiles nil)

    ;; Default shell
    (setq shell-file-name "/bin/sh")
    (setq sh-shell-file "/bin/sh")

    ;; Frame title
    ;; Use current buffer name as frame title
    (setq frame-title-format "%b - Emacs")
    )
#+end_src
** Magit
#+begin_src emacs-lisp
  (use-package magit
    :straight t
    :bind
    (("C-c g /" . magit-dispatch)
     ("C-c g ." . magit-file-dispatch)
     ("C-c g '" . forge-dispatch)
     ("C-c g g" . magit-status)
     ("C-c g G" . magit-status-here)
     ("C-c g x" . magit-file-delete)
     ("C-c g B" . magit-blame-addition)
     ("C-c g C" . magit-clone)
     ("C-c g F" . magit-fetch)
     ("C-c g L" . magit-log-buffer-file)
     ("C-c g S" . magit-stage-file)
     ("C-c g U" . magit-unstage-file)
  	 :map magit-mode-map
     ("t" . magit-previous-line)
     ("n" . magit-next-line)
     ("p" . magit-section-toggle))
    :config
    (setq magit-display-buffer-function
        #'magit-display-buffer-fullframe-status-v1)
    (setq magit-bury-buffer-function
  				(lambda (&optional buffer-to-bury)
  					(magit-mode-quit-window t)))
    )
#+end_src
** Environment
For mac, use =exec-path-from-shell= to get environment variables from shell environment.
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :straight t
    :custom
    (exec-path-from-shell-debug t)
    (exec-path-from-shell-shell-name "/bin/zsh")
    :config
    (exec-path-from-shell-initialize))
#+end_src
** Amazon
Install =EmacsAmazonLibs= for work in Amazon. For more details about it, check internal [[https://w.amazon.com/bin/view/Emacs/][Emacs Wiki]]. Only enable this on work laptop.
#+begin_src emacs-lisp
  (when (equal (system-name) "7cf34dda6815")
     (straight-use-package
      '(EmacsAmazonLibs :type git
                        :host nil
                        :build t
                        :post-build (copy-file "emacs-amazon-libs/brazil-path-cache-artifacts"
                                               (straight--build-dir "EmacsAmazonLibs"))
                        :repo "ssh://git.amazon.com:2222/pkg/EmacsAmazonLibs")
      )

     (add-to-list 'load-path "~/.emacs.d/straight/repos/EmacsAmazonLibs/emacs-amazon-libs/")
     (use-package amz-common
       :straight (:host nil :repo "ssh://git.amazon.com/pkg/EmacsAmazonLibs"
                        :files ("emacs-amazon-libs/amz-common.el"
                                "emacs-amazon-libs/texi/*.texi"))
       )
     ;; integrate with brazil
     (use-package amz-brazil-config
       :straight (:host nil :repo "ssh://git.amazon.com/pkg/EmacsAmazonLibs"
                        :files ("emacs-amazon-libs/amz-brazil-config.el"))
       )
     (use-package amz-workspace
       :after amz-common
       :straight (:host nil :repo "ssh://git.amazon.com/pkg/EmacsAmazonLibs"
                        :files ("emacs-amazon-libs/amz-workspace.el"
                                "emacs-amazon-libs/amz-coral.el"
                                "emacs-amazon-libs/amz-bmds.el"
                                "emacs-amazon-libs/amz-brazil-cache.el"
                                "emacs-amazon-libs/amz-brazil-config-parser.el"
                                "emacs-amazon-libs/amz-shell.el"
                                "emacs-amazon-libs/brazil-path-cache-artifacts"))
       :custom (amz-workspace-default-root-directory "~/local/projects")
       )
     (use-package amz-package
       :after amz-workspace)
     (use-package amz-brazil-cache)
     ;; amazon q developer
     (use-package amz-q-chat
       :bind (("C-c q t" . 'amz-q-chat-toggle)
  	    ("C-c q q" . 'amz-q-chat-stop)
  	    ("C-c q r" . 'amz-q-chat-restart)))
     (use-package amz-q-ide
       :after lsp-mode
       :custom
       (amz-lsp-codewhisperer-program "~/repos/AmazonQNVim/language-server/build/aws-lsp-codewhisperer-token-binary.js")
       :config
       (amz-q-ide-setup)
       )

     ;; embark integration
     (use-package amz-embark
       :after embark)

     ;; amz-coral
     (use-package amz-coral)

     ;; smithy-mode
     (use-package smithy-mode)
     )
#+end_src

Use =brief=, which is an Emacs minor-mode that provides a transient interface for Brazil CLI.
#+begin_src emacs-lisp
  (use-package amz-brief
    :straight '(amz-brief :type git :host nil :repo "ssh://git.amazon.com:2222/pkg/Brief")
    :defer t
    :bind (:map amz-brief-mode-map
             ("C-<tab>" . amz-brief))
    :config
    (setq amz-brief-default-host "zkli-clouddesk.aka.corp.amazon.com"
          amz-brief-remote-workplace-dir "~/workplace"
          amz-brief-preferred-development-style "HYBRID"
          amz-brief-autosave-custom-commands t))
#+end_src
#+end_src
* Completion
