config.org
*** lsp-mode
#+begin_src emacs-lisp
  (use-package lsp-mode
    :straight t
    :hook (((java-mode java-ts-mode) . lsp-deferred)
  	 (python-mode . lsp-deferred)
  	 (rust-mode . lsp-deferred)
  	 (lsp-completion-mode . yu/lsp-mode-setup-completion))
    :init
    (defun yu/lsp-mode-setup-completion ()
      (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
            '(orderless)) ;; Configure orderless
      (setq-local completion-at-point-functions
  		(list (cape-capf-buster
                         #'lsp-completion-at-point))))
    :bind (:map lsp-mode-map
  	      ("C-c c a" . lsp-execute-code-action)
                ("C-c c r" . lsp-rename)
                ("C-c c f" . lsp-format-buffer)
                ("C-c c d" . lsp-find-definition)
                ("C-c c D" . lsp-find-declaration)
                ("C-c c I" . lsp-find-implementation)
                ("C-c c T" . lsp-find-type-definition)
                ("C-c c R" . lsp-find-references)
                ("C-c c h" . lsp-describe-thing-at-point)
                ("C-c c s" . lsp-workspace-symbol)
                ("C-c c S" . lsp-document-symbol)
                ("C-c c o" . lsp-organize-imports)
                ("C-c c x" . lsp-diagnostics)
                ("C-c c n" . lsp-flycheck-next-error)
                ("C-c c p" . lsp-flycheck-previous-error)
                ("C-c c SPC" . lsp-signature-help)
                ("C-c c !"   . lsp-restart-workspace))
    :commands (lsp lsp-deferred)
    :custom
    (lsp-enable-file-watchers t)
    (lsp-completion-provider :none) ;; use corfu instead
    (lsp-use-plists t)
    (read-process-output-max (* 1024 1024)) ;; increase the amount of data reads from the process
    (lsp-log-io nil) ;; only enable logging when debugging
    :config
    ;; custom file watch ignored files
    (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\build\\'")
    (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.bemol\\'")
    (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\env\\'")
    (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\generated-src\\'")
    (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\generated-tst\\'")
    )

  (use-package lsp-ui
    :straight t
    :commands lsp-ui-mode
    :bind (:map lsp-ui-mode-map
  	      ([remap xref-find-definitions] . 'lsp-ui-peek-find-definitions)
  	      ([remap xref-find-references] . 'lsp-ui-peek-find-references))
    :custom
    (lsp-ui-peek-enable t)
    (lsp-ui-peek-show-directory t)
    )

  (use-package lsp-treemacs
    :straight
    :after lsp-ui
    :init
    (lsp-treemacs-sync-mode)
    :bind (:map lsp-mode-map
  	      ("C-c c e" . 'lsp-treemacs-errors-list)))
#+end_src
Enable plist in =early-init.el=.
#+begin_src emacs-lisp :tangle ./early-init.el
  (setenv "LSP_USE_PLISTS" "true")
#+end_src

Enable [[https://github.com/blahgeek/emacs-lsp-booster?tab=readme-ov-file][emacs-lsp-booster]] for =lsp-mode= to improve performance.
#+begin_src emacs-lisp
  (defun lsp-booster--advice-json-parse (old-fn &rest args)
    "Try to parse bytecode instead of json."
    (or
     (when (equal (following-char) ?#)
       (let ((bytecode (read (current-buffer))))
         (when (byte-code-function-p bytecode)
           (funcall bytecode))))
     (apply old-fn args)))
  (advice-add (if (progn (require 'json)
                         (fboundp 'json-parse-buffer))
                  'json-parse-buffer
                'json-read)
              :around
              #'lsp-booster--advice-json-parse)

  (defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
    "Prepend emacs-lsp-booster command to lsp CMD."
    (let ((orig-result (funcall old-fn cmd test?)))
      (if (and (not test?)                             ;; for check lsp-server-present?
               (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
               lsp-use-plists
               (not (functionp 'json-rpc-connection))  ;; native json-rpc
               (executable-find "emacs-lsp-booster"))
          (progn
            (when-let ((command-from-exec-path (executable-find (car orig-result))))  ;; resolve command from exec-path (in case not found in $PATH)
              (setcar orig-result command-from-exec-path))
            (message "Using emacs-lsp-booster for %s!" orig-result)
            (cons "emacs-lsp-booster" orig-result))
        orig-result)))
  (advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)
#+end_src
** Copilot
Use ~copilot~ to provide code completion. It is a language server that provides completion and other features for many languages.
#+begin_src emacs-lisp
  (use-package copilot
    :unless (eq system-type 'darwin)
    :straight (:host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
  	:defer t
  	:hook (prog-mode . copilot-mode)
  	:bind (:map copilot-completion-map
  							("C-e" . +copilot-complete)
  							("M-f" . +copilot-complete-word))
  	:config
  	(setq copilot-indent-offset-warning-disable t)
   
  	(defun +copilot-complete ()
      (interactive)
      (or (copilot-accept-completion)
          (mwim-end-of-code-or-line)))

    (defun +copilot-complete-word ()
      (interactive)
      (or (copilot-accept-completion-by-word 1)
          (forward-word))))
#+end_src
* Editor
** Meow
#+begin_src emacs-lisp
  (use-package meow
    :straight t
    :config
    (defun meow-setup ()
      (setq meow-cheatsheet-layout meow-cheatsheet-layout-dvorak)
      (meow-leader-define-key
       '("1" . meow-digit-argument)
       '("2" . meow-digit-argument)
       '("3" . meow-digit-argument)
       '("4" . meow-digit-argument)
       '("5" . meow-digit-argument)
       '("6" . meow-digit-argument)
       '("7" . meow-digit-argument)
       '("8" . meow-digit-argument)
       '("9" . meow-digit-argument)
       '("0" . meow-digit-argument)
       '("/" . meow-keypad-describe-key)
       '("?" . meow-cheatsheet))
      (meow-motion-overwrite-define-key
       ;; custom keybinding for motion state
       '("<escape>" . ignore))
      (meow-normal-define-key
       '("0" . meow-expand-0)
       '("9" . meow-expand-9)
       '("8" . meow-expand-8)
       '("7" . meow-expand-7)
       '("6" . meow-expand-6)
       '("5" . meow-expand-5)
       '("4" . meow-expand-4)
       '("3" . meow-expand-3)
       '("2" . meow-expand-2)
       '("1" . meow-expand-1)
       '("-" . negative-argument)
       '(";" . meow-reverse)
       '("," . meow-inner-of-thing)
       '("." . meow-bounds-of-thing)
       '("<" . meow-beginning-of-thing)
       '(">" . meow-end-of-thing)
       '("a" . meow-append)
       '("A" . meow-open-below)
       '("b" . meow-back-word)
       '("B" . meow-back-symbol)
       '("c" . meow-change)
       '("d" . meow-delete)
       '("D" . meow-backward-delete)
       '("e" . meow-line)
       '("E" . meow-goto-line)
       '("f" . meow-find)
       '("g" . meow-cancel-selection)
       '("G" . meow-grab)
       '("h" . meow-left)
       '("H" . meow-left-expand)
       '("i" . meow-insert)
       '("I" . meow-open-above)
       '("j" . meow-join)
       '("J" . meow-page-down)
       '("K" . meow-page-up)
       '("k" . meow-kill)
       '("l" . meow-till)
       '("m" . meow-mark-word)
       '("M" . meow-mark-symbol)
       '("n" . meow-next)
       '("N" . meow-next-expand)
       '("o" . meow-block)
       '("O" . meow-to-block)
       '("t" . meow-prev)
       '("T" . meow-prev-expand)
       '("q" . meow-quit)
       '("Q" . consult-goto-line) ; Consult goto-line with live preview
       '("r" . meow-replace)
       '("R" . meow-swap-grab)
       '("p" . meow-search)
       '("s" . meow-right)
       '("S" . meow-right-expand)
       '("u" . meow-undo)
       '("U" . undo-redo)
       '("v" . meow-visit)
       '("w" . meow-next-word)
       '("W" . meow-next-symbol)
       '("x" . meow-save)
       '("X" . meow-sync-grab)
       '("y" . meow-yank)
       '("Y" . consult-yank-from-kill-ring) ; Consult view yank history
       '("z" . meow-pop-selection)
       '("'" . repeat)
       '("<f5>" . consult-kmacro) ; Consult kmacro
       '("<escape>" . ignore)))
    (meow-setup)
    (meow-global-mode 1)
  	)
#+end_src
** Parenthesis
#+begin_src emacs-lisp
  (use-package electric-pair
    :hook
    (prog-mode . electric-pair-mode))

  ;; Puni for customizable soft deletion methods
  (use-package puni
    :straight t
    :defer t
    :hook
    (term-mode . puni-disable-puni-mode)
    :init
    (puni-global-mode)
    :bind (("C-c e (" . 'puni-wrap-round)
  	 ("C-c e )" . 'puni-wrap-round)
  	 ("C-c e {" . 'puni-wrap-curly)
  	 ("C-c e }" . 'puni-wrap-curly)
  	 ("C-c e [" . 'puni-wrap-square)
  	 ("C-c e ]" . 'puni-wrap-square)
  	 ("C-h" . 'puni-force-delete))
    :config
    (defun puni-kill-line ()
      "Kill a line forward while keeping expressions balanced."
      (interactive)
      (puni-soft-delete-by-move
       ;; FUNC: `puni-soft-delete-by-move` softly deletes the region from
       ;; cursor to the position after calling FUNC.
       (lambda ()
         (if (eolp) (forward-char) (end-of-line)))
       ;; STRICT-SEXP: More on this later.
       'strict-sexp
       ;; STYLE: More on this later.
       'within
       ;; KILL: Save deleted region to kill-ring if non-nil.
       'kill
       ;; FAIL-ACTION argument is not used here.
       'delete-one
       ))
    (setq puni-confirm-when-delete-unbalanced-active-region nil)
    )
#+end_src
** Undo-Redo
#+begin_src emacs-lisp
  (use-package undo-fu
    :straight t
    :config
    (global-unset-key (kbd "C-/"))
    (global-set-key (kbd "C-/")   'undo-fu-only-undo)
    (global-set-key (kbd "C-S-/") 'undo-fu-only-redo))

  ;; Save undo-tree information across session
  (use-package undo-fu-session
    :straight t
    :config
    (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'"
  					     "/git-rebase-todo\\'"))
    (undo-fu-session-global-mode))
#+end_src
** Code folding
#+begin_src emacs-lisp
  (use-package treesit-fold
    :straight (treesit-fold :type git :host github :repo "emacs-tree-sitter/treesit-fold")
    :bind (:map treesit-fold-mode-map
  	      ("C-c @ t" . 'treesit-fold-toggle)
  	      ("C-c @ o" . 'treesit-fold-open-recursively)
  	      ("C-c @ O" . 'treesit-fold-open-all)
  	      ("C-c @ c" . 'treesit-fold-close)
  	      ("C-c @ C" . 'treesit-fold-close-all))
    :init
    (global-treesit-fold-mode))
#+end_src
** Rime
#+begin_src emacs-lisp
  (use-package rime
    :straight (rime :type git
                    :host github
                    :repo "DogLooksGood/emacs-rime"
                    :files ("*.el" "Makefile" "lib.c"))
  	:disabled
    :custom
    (default-input-method "rime")
    ;; Custom lib path for NixOS
    (rime-share-data-dir "/usr/share/rime-data")
    (rime-emacs-module-header-root (concat (yu/nixos-get-package-path "emacs-pgtk") "include"))
    (rime-librime-root (yu/nixos-get-package-path "librime"))
    ;; :hook
    ;; (input-method-activate . (lambda () (shell-command "hyprctl switchxkblayout keychron-keychron-v1 1")))
    ;; (input-method-deactivate . (lambda () (shell-command "hyprctl switchxkblayout keychron-keychron-v1 0")))
    :config
    (defun rime-predicate-meow-mode-p ()
      "Detect whether the current buffer is in `meow' state.
      Include `meow-normal-state' ,`meow-motion-state' , `meow-keypad-state'.
      Can be used in `rime-disable-predicates' and `rime-inline-predicates'."
      (and (fboundp 'meow-mode)
           (or (meow-normal-mode-p)
               (meow-keypad-mode-p)
               (meow-motion-mode-p))))
    (setq rime-disable-predicates
          '(rime-predicate-meow-mode-p
            rime-predicate-after-alphabet-char-p
            rime-predicate-tex-math-or-command-p
            rime-predicate-punctuation-after-space-cc-p
            rime-predicate-prog-in-code-p
  	  rime-predicate-ace-window-p
  	  rime-predicate-current-uppercase-letter-p
            ;; rime-predicate-punctuation-line-begin-p
            ;; rime-predicate-current-uppercase-letter-p
            ))
    ;; ;; (setq rime-disable-predicates nil)
    (setq rime-inline-predicates
          '(rime-predicate-space-after-cc-p))
    (setq rime-inline-ascii-trigger 'shift-l)
    (setq rime-show-candidate 'posframe)
    (define-key rime-mode-map (kbd "M-i") 'rime-force-enable))
        #+END_src
** Smart Input Source
Another workaround of using IM inside Emacs. SIS add predicates and switches for system IM so that you can switch to ascii input when switch to mini-buffer, normal mode, etc.. However, enabling ~sis-global-respect-mode~ will cause extreme lag, so I had to comment this package.
#+begin_src emacs-lisp
  (use-package sis
    :straight t
    :config
    (sis-ism-lazyman-config "1" "2" 'fcitx5)
    ;; enable the /respect/ mode
    (sis-global-respect-mode t)
    ;; enable the /context/ mode for all buffers
    (sis-global-context-mode t)
    ;; enable the /inline english/ mode for all buffers
    (sis-global-inline-mode t)
  	;; enable the /cursor color/ mode
    (sis-global-cursor-color-mode t)
    ;; support for meow
    (add-hook 'meow-insert-exit-hook #'sis-set-english)
  	(add-hook 'meow-vterm-insert-mode-hook #'sis-set-english)
    (add-to-list 'sis-context-hooks 'meow-insert-enter-hook))
#+end_src
** Git diffs
#+begin_src emacs-lisp
  (use-package diff-hl
    :straight t
    :init
    (global-diff-hl-mode)
    :hook
    (magit-post-refresh . diff-hl-magit-post-refresh))
#+end_src
* Shell
** eshell
#+begin_src emacs-lisp
  ;; Use pcomplete to generate shell completion
  (use-package pcmpl-args
    :straight t)

  (use-package eshell-toggle
  	:straight (eshell-toggle :type git :host github :repo "4DA/eshell-toggle")
  	:bind ("C-~" . eshell-toggle)
  	:custom
  	(eshell-toggle-find-project-root-package t) ;; for projectile
  	)
#+end_src
** vterm
#+begin_src emacs-lisp
  (use-package vterm
    :straight t
    :config
    (if (eq system-type 'darwin)
        (setq vterm-shell "/bin/zsh")
      (setq vterm-shell "/run/current-system/sw/bin/nu"))
    )

  (use-package meow-vterm
  	:straight (meow-vterm :type git :host github :repo "45mg/meow-vterm")
  	:config
  	(add-hook 'vterm-mode-hook #'meow-vterm-mode)
    (meow-define-keys 'vterm-normal
      '("y" . meow-vterm-yank)
      '("Y" . meow-vterm-yank-pop)
      '("u" . meow-vterm-undo)
      '("x" . meow-vterm-yank)
      '("X" . meow-vterm-yank-pop)
      '("s" . meow-vterm-kill)
      '("k" . meow-vterm-delete)
      '("D" . meow-vterm-backspace)
      '("G" . ignore)) ; see below
  	)
#+end_src
* Enhancement
