early-init.el

(setenv "LSP_USE_PLISTS" "true")
